---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctSettings.NetworkBasedCalculations
source: html/b888c721-828c-a71e-32bb-5545f8e07103.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSettings.NetworkBasedCalculations Property

Indicates whether to enable network based calculations for duct networks.

## Syntax (C#)
```csharp
public bool NetworkBasedCalculations { get; set; }
```